//Валера добавил этот модуль и процедуру по задаче 1.3
Процедура ДобавитьРеквизитКонтактноеЛицоНаФорму(Форма) Экспорт
	Элементы = Форма.Элементы;
	Если Элементы.Найти("ГруппаШапкаПраво") <> Неопределено Тогда
		ЭлементФормы = Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Элементы.ГруппаШапкаПраво);
		ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементФормы.ПутьКДанным = "Объект.ДопФункц_КонтактноеЛицо";
	Иначе 	
		ЭлементФормы = Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), Форма, ?(Элементы.Найти("Основание") <> Неопределено, Элементы.Основание, Элементы.СуммаДокумента));
		ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементФормы.ПутьКДанным = "Объект.ДопФункц_КонтактноеЛицо";	
	КонецЕсли;
КонецПроцедуры