
Функция ПроверкаДоступа(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);   
	Ответ.УстановитьТелоИзСтроки("Всё гуд");
	Возврат Ответ;
КонецФункции

Функция goodsПолучитьЗаказы(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	Сотрудник = ПользователиИнформационнойБазы.ТекущийПользователь();
	Если Сотрудник <> Неопределено Тогда
		КоличествоЗаказов = ПолучитьКоличествоЗаказовСотрудника(Сотрудник);
	Иначе
		Ответ.УстановитьТелоИзСтроки("Не удалось установить пользователя");
	КонецЕсли;
	
	Ответ.УстановитьТелоИзСтроки(Строка(КоличествоЗаказов));
	Возврат Ответ;
КонецФункции
       
Функция ПолучитьКоличествоЗаказовСотрудника(Сотрудник)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказПокупателя.Ссылка) КАК КолВоЗаказов
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ответственный = &Сотрудник";
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КолВоЗаказов;
	КонецЕсли;
	
	Возврат 0;
КонецФункции